MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334JATI/mcu.h
/*******************************************************************************
                Bit definition for Peripheral HRPWM
*******************************************************************************/
/*  Bit definition for HRPWM_CNTER register  */
#define HRPWM_CNTER_CNT                                (0x003FFFFFUL)

/*  Bit definition for HRPWM_UPDAR register  */
#define HRPWM_UPDAR_UPDA                               (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRPERAR register  */
#define HRPWM_HRPERAR_HRPERA                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRPERBR register  */
#define HRPWM_HRPERBR_HRPERB                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMAR register  */
#define HRPWM_HRGCMAR_HRGCMA                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMBR register  */
#define HRPWM_HRGCMBR_HRGCMB                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMCR register  */
#define HRPWM_HRGCMCR_HRGCMC                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMDR register  */
#define HRPWM_HRGCMDR_HRGCMD                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMER register  */
#define HRPWM_HRGCMER_HRGCME                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMFR register  */
#define HRPWM_HRGCMFR_HRGCMF                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMGR register  */
#define HRPWM_HRGCMGR_HRGCMG                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRGCMHR register  */
#define HRPWM_HRGCMHR_HRGCMH                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_SCMAR register  */
#define HRPWM_SCMAR_SCMA                               (0x003FFFFFUL)

/*  Bit definition for HRPWM_SCMBR register  */
#define HRPWM_SCMBR_SCMB                               (0x003FFFFFUL)

/*  Bit definition for HRPWM_SCMCR register  */
#define HRPWM_SCMCR_SCMC                               (0x003FFFFFUL)

/*  Bit definition for HRPWM_SCMDR register  */
#define HRPWM_SCMDR_SCMD                               (0x003FFFFFUL)

/*  Bit definition for HRPWM_CAPAR register  */
#define HRPWM_CAPAR_CAPA_POS                           (0U)
#define HRPWM_CAPAR_CAPA                               (0x003FFFFFUL)
#define HRPWM_CAPAR_CAPDIRA_POS                        (22U)
#define HRPWM_CAPAR_CAPDIRA                            (0x00400000UL)

/*  Bit definition for HRPWM_CAPBR register  */
#define HRPWM_CAPBR_CAPB_POS                           (0U)
#define HRPWM_CAPBR_CAPB                               (0x003FFFFFUL)
#define HRPWM_CAPBR_CAPDIRB_POS                        (22U)
#define HRPWM_CAPBR_CAPDIRB                            (0x00400000UL)

/*  Bit definition for HRPWM_HRDTUAR register  */
#define HRPWM_HRDTUAR_HRDTUA                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRDTDAR register  */
#define HRPWM_HRDTDAR_HRDTDA                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRDTUBR register  */
#define HRPWM_HRDTUBR_HRDTUB                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_HRDTDBR register  */
#define HRPWM_HRDTDBR_HRDTDB                           (0x003FFFFFUL)

/*  Bit definition for HRPWM_GCONR register  */
#define HRPWM_GCONR_START_POS                          (0U)
#define HRPWM_GCONR_START                              (0x00000001UL)
#define HRPWM_GCONR_MODE_POS                           (2U)
#define HRPWM_GCONR_MODE                               (0x00000004UL)
#define HRPWM_GCONR_OVSTP_POS                          (8U)
#define HRPWM_GCONR_OVSTP                              (0x00000100UL)

/*  Bit definition for HRPWM_ICONR register  */
#define HRPWM_ICONR_INTENA_POS                         (0U)
#define HRPWM_ICONR_INTENA                             (0x00000001UL)
#define HRPWM_ICONR_INTENB_POS                         (1U)
#define HRPWM_ICONR_INTENB                             (0x00000002UL)
#define HRPWM_ICONR_INTENC_POS                         (2U)
#define HRPWM_ICONR_INTENC                             (0x00000004UL)
#define HRPWM_ICONR_INTEND_POS                         (3U)
#define HRPWM_ICONR_INTEND                             (0x00000008UL)
#define HRPWM_ICONR_INTENE_POS                         (4U)
#define HRPWM_ICONR_INTENE                             (0x00000010UL)
#define HRPWM_ICONR_INTENF_POS                         (5U)
#define HRPWM_ICONR_INTENF                             (0x00000020UL)
#define HRPWM_ICONR_INTENOVF_POS                       (6U)
#define HRPWM_ICONR_INTENOVF                           (0x00000040UL)
#define HRPWM_ICONR_INTENUDF_POS                       (7U)
#define HRPWM_ICONR_INTENUDF                           (0x00000080UL)
#define HRPWM_ICONR_INTENCAPA_POS                      (14U)
#define HRPWM_ICONR_INTENCAPA                          (0x00004000UL)
#define HRPWM_ICONR_INTENCAPB_POS                      (15U)
#define HRPWM_ICONR_INTENCAPB                          (0x00008000UL)
#define HRPWM_ICONR_INTENSAU_POS                       (16U)
#define HRPWM_ICONR_INTENSAU                           (0x00010000UL)
#define HRPWM_ICONR_INTENSAD_POS                       (17U)
#define HRPWM_ICONR_INTENSAD                           (0x00020000UL)
#define HRPWM_ICONR_INTENSBU_POS                       (18U)
#define HRPWM_ICONR_INTENSBU                           (0x00040000UL)
#define HRPWM_ICONR_INTENSBD_POS                       (19U)
#define HRPWM_ICONR_INTENSBD                           (0x00080000UL)

/*  Bit definition for HRPWM_BCONR1 register  */
#define HRPWM_BCONR1_BENAE_POS                         (0U)
#define HRPWM_BCONR1_BENAE                             (0x00000001UL)
#define HRPWM_BCONR1_BTRUAE_POS                        (2U)
#define HRPWM_BCONR1_BTRUAE                            (0x00000004UL)
#define HRPWM_BCONR1_BTRDAE_POS                        (3U)
#define HRPWM_BCONR1_BTRDAE                            (0x00000008UL)
#define HRPWM_BCONR1_BENBF_POS                         (4U)
#define HRPWM_BCONR1_BENBF                             (0x00000010UL)
#define HRPWM_BCONR1_BTRUBF_POS                        (6U)
#define HRPWM_BCONR1_BTRUBF                            (0x00000040UL)
#define HRPWM_BCONR1_BTRDBF_POS                        (7U)
#define HRPWM_BCONR1_BTRDBF                            (0x00000080UL)
#define HRPWM_BCONR1_BENP_POS                          (8U)
#define HRPWM_BCONR1_BENP                              (0x00000100UL)
#define HRPWM_BCONR1_BTRUP_POS                         (10U)
#define HRPWM_BCONR1_BTRUP                             (0x00000400UL)
#define HRPWM_BCONR1_BTRDP_POS                         (11U)
#define HRPWM_BCONR1_BTRDP                             (0x00000800UL)
#define HRPWM_BCONR1_BENSPA_POS                        (16U)
#define HRPWM_BCONR1_BENSPA                            (0x00010000UL)
#define HRPWM_BCONR1_BTRUSPA_POS                       (18U)
#define HRPWM_BCONR1_BTRUSPA                           (0x00040000UL)
#define HRPWM_BCONR1_BTRDSPA_POS                       (19U)
#define HRPWM_BCONR1_BTRDSPA                           (0x00080000UL)
#define HRPWM_BCONR1_BENSPB_POS                        (20U)
#define HRPWM_BCONR1_BENSPB                            (0x00100000UL)
#define HRPWM_BCONR1_BTRUSPB_POS                       (22U)
#define HRPWM_BCONR1_BTRUSPB                           (0x00400000UL)
#define HRPWM_BCONR1_BTRDSPB_POS                       (23U)
#define HRPWM_BCONR1_BTRDSPB                           (0x00800000UL)

/*  Bit definition for HRPWM_DCONR register  */
#define HRPWM_DCONR_DTCEN_POS                          (0U)
#define HRPWM_DCONR_DTCEN                              (0x00000001UL)
#define HRPWM_DCONR_SEPA_POS                           (1U)
#define HRPWM_DCONR_SEPA                               (0x00000002UL)
#define HRPWM_DCONR_DTBENU_POS                         (4U)
#define HRPWM_DCONR_DTBENU                             (0x00000010UL)
#define HRPWM_DCONR_DTBEND_POS                         (5U)
#define HRPWM_DCONR_DTBEND                             (0x00000020UL)
#define HRPWM_DCONR_DTBTRU_POS                         (6U)
#define HRPWM_DCONR_DTBTRU                             (0x00000040UL)
#define HRPWM_DCONR_DTBTRD_POS                         (7U)
#define HRPWM_DCONR_DTBTRD                             (0x00000080UL)

/*  Bit definition for HRPWM_PCNAR1 register  */
#define HRPWM_PCNAR1_STACA_POS                         (0U)
#define HRPWM_PCNAR1_STACA                             (0x00000003UL)
#define HRPWM_PCNAR1_STACA_0                           (0x00000001UL)
#define HRPWM_PCNAR1_STACA_1                           (0x00000002UL)
#define HRPWM_PCNAR1_STPCA_POS                         (2U)
#define HRPWM_PCNAR1_STPCA                             (0x0000000CUL)
#define HRPWM_PCNAR1_STPCA_0                           (0x00000004UL)
#define HRPWM_PCNAR1_STPCA_1                           (0x00000008UL)
#define HRPWM_PCNAR1_OVFCA_POS                         (4U)
#define HRPWM_PCNAR1_OVFCA                             (0x00000030UL)
#define HRPWM_PCNAR1_OVFCA_0                           (0x00000010UL)
#define HRPWM_PCNAR1_OVFCA_1                           (0x00000020UL)
#define HRPWM_PCNAR1_UDFCA_POS                         (6U)
#define HRPWM_PCNAR1_UDFCA                             (0x000000C0UL)
#define HRPWM_PCNAR1_UDFCA_0                           (0x00000040UL)
#define HRPWM_PCNAR1_UDFCA_1                           (0x00000080UL)
#define HRPWM_PCNAR1_CMAUCA_POS                        (8U)
#define HRPWM_PCNAR1_CMAUCA                            (0x00000300UL)
#define HRPWM_PCNAR1_CMAUCA_0                          (0x00000100UL)
#define HRPWM_PCNAR1_CMAUCA_1                          (0x00000200UL)
#define HRPWM_PCNAR1_CMADCA_POS                        (10U)
#define HRPWM_PCNAR1_CMADCA                            (0x00000C00UL)
#define HRPWM_PCNAR1_CMADCA_0                          (0x00000400UL)
#define HRPWM_PCNAR1_CMADCA_1                          (0x00000800UL)
#define HRPWM_PCNAR1_CMBUCA_POS                        (12U)
#define HRPWM_PCNAR1_CMBUCA                            (0x00003000UL)
#define HRPWM_PCNAR1_CMBUCA_0                          (0x00001000UL)
#define HRPWM_PCNAR1_CMBUCA_1                          (0x00002000UL)
#define HRPWM_PCNAR1_CMBDCA_POS                        (14U)
#define HRPWM_PCNAR1_CMBDCA                            (0x0000C000UL)
#define HRPWM_PCNAR1_CMBDCA_0                          (0x00004000UL)
#define HRPWM_PCNAR1_CMBDCA_1                          (0x00008000UL)
#define HRPWM_PCNAR1_FORCA_POS                         (16U)
#define HRPWM_PCNAR1_FORCA                             (0x00030000UL)
#define HRPWM_PCNAR1_FORCA_0                           (0x00010000UL)
#define HRPWM_PCNAR1_FORCA_1                           (0x00020000UL)
#define HRPWM_PCNAR1_EMBCA_POS                         (20U)
#define HRPWM_PCNAR1_EMBCA                             (0x00300000UL)
#define HRPWM_PCNAR1_EMBCA_0                           (0x00100000UL)
#define HRPWM_PCNAR1_EMBCA_1                           (0x00200000UL)
#define HRPWM_PCNAR1_EMBRA_POS                         (22U)
#define HRPWM_PCNAR1_EMBRA                             (0x00C00000UL)
#define HRPWM_PCNAR1_EMBRA_0                           (0x00400000UL)
#define HRPWM_PCNAR1_EMBRA_1                           (0x00800000UL)
#define HRPWM_PCNAR1_EMBSA_POS                         (24U)
#define HRPWM_PCNAR1_EMBSA                             (0x07000000UL)
#define HRPWM_PCNAR1_OUTENA_POS                        (28U)
#define HRPWM_PCNAR1_OUTENA                            (0x10000000UL)

/*  Bit definition for HRPWM_PCNBR1 register  */
#define HRPWM_PCNBR1_STACB_POS                         (0U)
#define HRPWM_PCNBR1_STACB                             (0x00000003UL)
#define HRPWM_PCNBR1_STACB_0                           (0x00000001UL)
#define HRPWM_PCNBR1_STACB_1                           (0x00000002UL)
#define HRPWM_PCNBR1_STPCB_POS                         (2U)
#define HRPWM_PCNBR1_STPCB                             (0x0000000CUL)
#define HRPWM_PCNBR1_STPCB_0                           (0x00000004UL)
#define HRPWM_PCNBR1_STPCB_1                           (0x00000008UL)
#define HRPWM_PCNBR1_OVFCB_POS                         (4U)
#define HRPWM_PCNBR1_OVFCB                             (0x00000030UL)
#define HRPWM_PCNBR1_OVFCB_0                           (0x00000010UL)
#define HRPWM_PCNBR1_OVFCB_1                           (0x00000020UL)
#define HRPWM_PCNBR1_UDFCB_POS                         (6U)
#define HRPWM_PCNBR1_UDFCB                             (0x000000C0UL)
#define HRPWM_PCNBR1_UDFCB_0                           (0x00000040UL)
#define HRPWM_PCNBR1_UDFCB_1                           (0x00000080UL)
#define HRPWM_PCNBR1_CMAUCB_POS                        (8U)
#define HRPWM_PCNBR1_CMAUCB                            (0x00000300UL)
#define HRPWM_PCNBR1_CMAUCB_0                          (0x00000100UL)
#define HRPWM_PCNBR1_CMAUCB_1                          (0x00000200UL)
#define HRPWM_PCNBR1_CMADCB_POS                        (10U)
#define HRPWM_PCNBR1_CMADCB                            (0x00000C00UL)
#define HRPWM_PCNBR1_CMADCB_0                          (0x00000400UL)
#define HRPWM_PCNBR1_CMADCB_1                          (0x00000800UL)
#define HRPWM_PCNBR1_CMBUCB_POS                        (12U)
#define HRPWM_PCNBR1_CMBUCB                            (0x00003000UL)
#define HRPWM_PCNBR1_CMBUCB_0                          (0x00001000UL)
#define HRPWM_PCNBR1_CMBUCB_1                          (0x00002000UL)
#define HRPWM_PCNBR1_CMBDCB_POS                        (14U)
#define HRPWM_PCNBR1_CMBDCB                            (0x0000C000UL)
#define HRPWM_PCNBR1_CMBDCB_0                          (0x00004000UL)
#define HRPWM_PCNBR1_CMBDCB_1                          (0x00008000UL)
#define HRPWM_PCNBR1_FORCB_POS                         (16U)
#define HRPWM_PCNBR1_FORCB                             (0x00030000UL)
#define HRPWM_PCNBR1_FORCB_0                           (0x00010000UL)
#define HRPWM_PCNBR1_FORCB_1                           (0x00020000UL)
#define HRPWM_PCNBR1_EMBCB_POS                         (20U)
#define HRPWM_PCNBR1_EMBCB                             (0x00300000UL)
#define HRPWM_PCNBR1_EMBCB_0                           (0x00100000UL)
#define HRPWM_PCNBR1_EMBCB_1                           (0x00200000UL)
#define HRPWM_PCNBR1_EMBRB_POS                         (22U)
#define HRPWM_PCNBR1_EMBRB                             (0x00C00000UL)
#define HRPWM_PCNBR1_EMBRB_0                           (0x00400000UL)
#define HRPWM_PCNBR1_EMBRB_1                           (0x00800000UL)
#define HRPWM_PCNBR1_EMBSB_POS                         (24U)
#define HRPWM_PCNBR1_EMBSB                             (0x07000000UL)
#define HRPWM_PCNBR1_OUTENB_POS                        (28U)
#define HRPWM_PCNBR1_OUTENB                            (0x10000000UL)

/*  Bit definition for HRPWM_VPERR register  */
#define HRPWM_VPERR_SPPERIA_POS                        (8U)
#define HRPWM_VPERR_SPPERIA                            (0x00000100UL)
#define HRPWM_VPERR_SPPERIB_POS                        (9U)
#define HRPWM_VPERR_SPPERIB                            (0x00000200UL)
#define HRPWM_VPERR_PCNTE_POS                          (16U)
#define HRPWM_VPERR_PCNTE                              (0x00030000UL)
#define HRPWM_VPERR_PCNTE_0                            (0x00010000UL)
#define HRPWM_VPERR_PCNTE_1                            (0x00020000UL)
#define HRPWM_VPERR_PCNTS_POS                          (18U)
#define HRPWM_VPERR_PCNTS                              (0x007C0000UL)

/*  Bit definition for HRPWM_STFLR1 register  */
#define HRPWM_STFLR1_CMAF_POS                          (0U)
#define HRPWM_STFLR1_CMAF                              (0x00000001UL)
#define HRPWM_STFLR1_CMBF_POS                          (1U)
#define HRPWM_STFLR1_CMBF                              (0x00000002UL)
#define HRPWM_STFLR1_CMCF_POS                          (2U)
#define HRPWM_STFLR1_CMCF                              (0x00000004UL)
#define HRPWM_STFLR1_CMDF_POS                          (3U)
#define HRPWM_STFLR1_CMDF                              (0x00000008UL)
#define HRPWM_STFLR1_CMEF_POS                          (4U)
#define HRPWM_STFLR1_CMEF                              (0x00000010UL)
#define HRPWM_STFLR1_CMFF_POS                          (5U)
#define HRPWM_STFLR1_CMFF                              (0x00000020UL)
#define HRPWM_STFLR1_OVFF_POS                          (6U)
#define HRPWM_STFLR1_OVFF                              (0x00000040UL)
#define HRPWM_STFLR1_UDFF_POS                          (7U)
#define HRPWM_STFLR1_UDFF                              (0x00000080UL)
#define HRPWM_STFLR1_CMSAUF_POS                        (9U)
#define HRPWM_STFLR1_CMSAUF                            (0x00000200UL)
#define HRPWM_STFLR1_CMSADF_POS                        (10U)
#define HRPWM_STFLR1_CMSADF                            (0x00000400UL)
#define HRPWM_STFLR1_CMSBUF_POS                        (11U)
#define HRPWM_STFLR1_CMSBUF                            (0x00000800UL)
#define HRPWM_STFLR1_CMSBDF_POS                        (12U)
#define HRPWM_STFLR1_CMSBDF                            (0x00001000UL)
#define HRPWM_STFLR1_VPERNUM_POS                       (21U)
#define HRPWM_STFLR1_VPERNUM                           (0x03E00000UL)
#define HRPWM_STFLR1_CAPAF_POS                         (26U)
#define HRPWM_STFLR1_CAPAF                             (0x04000000UL)
#define HRPWM_STFLR1_CAPBF_POS                         (27U)
#define HRPWM_STFLR1_CAPBF                             (0x08000000UL)
#define HRPWM_STFLR1_DIRF_POS                          (31U)
#define HRPWM_STFLR1_DIRF                              (0x80000000UL)

/*  Bit definition for HRPWM_STFLR2 register  */
#define HRPWM_STFLR2_DLYIDLEA_POS                      (0U)
#define HRPWM_STFLR2_DLYIDLEA                          (0x00000001UL)
#define HRPWM_STFLR2_DLYIDLEB_POS                      (1U)
#define HRPWM_STFLR2_DLYIDLEB                          (0x00000002UL)
#define HRPWM_STFLR2_DLYPRT_POS                        (2U)
#define HRPWM_STFLR2_DLYPRT                            (0x00000004UL)
#define HRPWM_STFLR2_OASTAT_POS                        (4U)
#define HRPWM_STFLR2_OASTAT                            (0x00000010UL)
#define HRPWM_STFLR2_OBSTAT_POS                        (5U)
#define HRPWM_STFLR2_OBSTAT                            (0x00000020UL)
#define HRPWM_STFLR2_PHSCMP1F_POS                      (11U)
#define HRPWM_STFLR2_PHSCMP1F                          (0x00000800UL)
#define HRPWM_STFLR2_PHSCMP2F_POS                      (12U)
#define HRPWM_STFLR2_PHSCMP2F                          (0x00001000UL)
#define HRPWM_STFLR2_PHSCMP3F_POS                      (13U)
#define HRPWM_STFLR2_PHSCMP3F                          (0x00002000UL)
#define HRPWM_STFLR2_PHSCMP4F_POS                      (14U)
#define HRPWM_STFLR2_PHSCMP4F                          (0x00004000UL)
#define HRPWM_STFLR2_PHSCMP5F_POS                      (15U)
#define HRPWM_STFLR2_PHSCMP5F                          (0x00008000UL)
#define HRPWM_STFLR2_OSTOVF_POS                        (16U)
#define HRPWM_STFLR2_OSTOVF                            (0x00010000UL)

