MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F334JATI/mcu.h
/*  Bit definition for HRPWM_HCPAR2 register  */
#define HRPWM_HCPAR2_HCPAEEV1_POS                      (0U)
#define HRPWM_HCPAR2_HCPAEEV1                          (0x00000001UL)
#define HRPWM_HCPAR2_HCPAEEV2_POS                      (1U)
#define HRPWM_HCPAR2_HCPAEEV2                          (0x00000002UL)
#define HRPWM_HCPAR2_HCPAEEV3_POS                      (2U)
#define HRPWM_HCPAR2_HCPAEEV3                          (0x00000004UL)
#define HRPWM_HCPAR2_HCPAEEV4_POS                      (3U)
#define HRPWM_HCPAR2_HCPAEEV4                          (0x00000008UL)
#define HRPWM_HCPAR2_HCPAEEV5_POS                      (4U)
#define HRPWM_HCPAR2_HCPAEEV5                          (0x00000010UL)
#define HRPWM_HCPAR2_HCPAEEV6_POS                      (5U)
#define HRPWM_HCPAR2_HCPAEEV6                          (0x00000020UL)
#define HRPWM_HCPAR2_HCPAEEV7_POS                      (6U)
#define HRPWM_HCPAR2_HCPAEEV7                          (0x00000040UL)
#define HRPWM_HCPAR2_HCPAEEV8_POS                      (7U)
#define HRPWM_HCPAR2_HCPAEEV8                          (0x00000080UL)
#define HRPWM_HCPAR2_HCPAEEV9_POS                      (8U)
#define HRPWM_HCPAR2_HCPAEEV9                          (0x00000100UL)
#define HRPWM_HCPAR2_HCPAEEV10_POS                     (9U)
#define HRPWM_HCPAR2_HCPAEEV10                         (0x00000200UL)
#define HRPWM_HCPAR2_HCPAEN_POS                        (10U)
#define HRPWM_HCPAR2_HCPAEN                            (0x00000400UL)

/*  Bit definition for HRPWM_HCPBR2 register  */
#define HRPWM_HCPBR2_HCPBEEV1_POS                      (0U)
#define HRPWM_HCPBR2_HCPBEEV1                          (0x00000001UL)
#define HRPWM_HCPBR2_HCPBEEV2_POS                      (1U)
#define HRPWM_HCPBR2_HCPBEEV2                          (0x00000002UL)
#define HRPWM_HCPBR2_HCPBEEV3_POS                      (2U)
#define HRPWM_HCPBR2_HCPBEEV3                          (0x00000004UL)
#define HRPWM_HCPBR2_HCPBEEV4_POS                      (3U)
#define HRPWM_HCPBR2_HCPBEEV4                          (0x00000008UL)
#define HRPWM_HCPBR2_HCPBEEV5_POS                      (4U)
#define HRPWM_HCPBR2_HCPBEEV5                          (0x00000010UL)
#define HRPWM_HCPBR2_HCPBEEV6_POS                      (5U)
#define HRPWM_HCPBR2_HCPBEEV6                          (0x00000020UL)
#define HRPWM_HCPBR2_HCPBEEV7_POS                      (6U)
#define HRPWM_HCPBR2_HCPBEEV7                          (0x00000040UL)
#define HRPWM_HCPBR2_HCPBEEV8_POS                      (7U)
#define HRPWM_HCPBR2_HCPBEEV8                          (0x00000080UL)
#define HRPWM_HCPBR2_HCPBEEV9_POS                      (8U)
#define HRPWM_HCPBR2_HCPBEEV9                          (0x00000100UL)
#define HRPWM_HCPBR2_HCPBEEV10_POS                     (9U)
#define HRPWM_HCPBR2_HCPBEEV10                         (0x00000200UL)
#define HRPWM_HCPBR2_HCPBEN_POS                        (10U)
#define HRPWM_HCPBR2_HCPBEN                            (0x00000400UL)

/*  Bit definition for HRPWM_BCONR2 register  */
#define HRPWM_BCONR2_BENEEFOFF_POS                     (0U)
#define HRPWM_BCONR2_BENEEFOFF                         (0x00000001UL)
#define HRPWM_BCONR2_BTRUEEFOFF_POS                    (1U)
#define HRPWM_BCONR2_BTRUEEFOFF                        (0x00000002UL)
#define HRPWM_BCONR2_BTRDEEFOFF_POS                    (2U)
#define HRPWM_BCONR2_BTRDEEFOFF                        (0x00000004UL)
#define HRPWM_BCONR2_BENEEFWIN_POS                     (3U)
#define HRPWM_BCONR2_BENEEFWIN                         (0x00000008UL)
#define HRPWM_BCONR2_BTRUEEFWIN_POS                    (4U)
#define HRPWM_BCONR2_BTRUEEFWIN                        (0x00000010UL)
#define HRPWM_BCONR2_BTRDEEFWIN_POS                    (5U)
#define HRPWM_BCONR2_BTRDEEFWIN                        (0x00000020UL)
#define HRPWM_BCONR2_BTRU0EEFOFF_POS                   (6U)
#define HRPWM_BCONR2_BTRU0EEFOFF                       (0x00000040UL)
#define HRPWM_BCONR2_BTRU0EEFWIN_POS                   (7U)
#define HRPWM_BCONR2_BTRU0EEFWIN                       (0x00000080UL)
#define HRPWM_BCONR2_BTRU0PEEFOFF_POS                  (8U)
#define HRPWM_BCONR2_BTRU0PEEFOFF                      (0x00000100UL)
#define HRPWM_BCONR2_BTRU0PEEFWIN_POS                  (9U)
#define HRPWM_BCONR2_BTRU0PEEFWIN                      (0x00000200UL)
#define HRPWM_BCONR2_BENCTL_POS                        (12U)
#define HRPWM_BCONR2_BENCTL                            (0x00001000UL)
#define HRPWM_BCONR2_BTRUCTL_POS                       (13U)
#define HRPWM_BCONR2_BTRUCTL                           (0x00002000UL)
#define HRPWM_BCONR2_BTRDCTL_POS                       (14U)
#define HRPWM_BCONR2_BTRDCTL                           (0x00004000UL)
#define HRPWM_BCONR2_BTRU0AE_POS                       (16U)
#define HRPWM_BCONR2_BTRU0AE                           (0x00010000UL)
#define HRPWM_BCONR2_BTRU0BF_POS                       (17U)
#define HRPWM_BCONR2_BTRU0BF                           (0x00020000UL)
#define HRPWM_BCONR2_BTRU0P_POS                        (18U)
#define HRPWM_BCONR2_BTRU0P                            (0x00040000UL)
#define HRPWM_BCONR2_BTRU0SPA_POS                      (19U)
#define HRPWM_BCONR2_BTRU0SPA                          (0x00080000UL)
#define HRPWM_BCONR2_BTRU0SPB_POS                      (20U)
#define HRPWM_BCONR2_BTRU0SPB                          (0x00100000UL)
#define HRPWM_BCONR2_BTRU0DT_POS                       (21U)
#define HRPWM_BCONR2_BTRU0DT                           (0x00200000UL)
#define HRPWM_BCONR2_BTRU0CTL_POS                      (22U)
#define HRPWM_BCONR2_BTRU0CTL                          (0x00400000UL)
#define HRPWM_BCONR2_BTRU0PAE_POS                      (23U)
#define HRPWM_BCONR2_BTRU0PAE                          (0x00800000UL)
#define HRPWM_BCONR2_BTRU0PBF_POS                      (24U)
#define HRPWM_BCONR2_BTRU0PBF                          (0x01000000UL)
#define HRPWM_BCONR2_BTRU0PP_POS                       (25U)
#define HRPWM_BCONR2_BTRU0PP                           (0x02000000UL)
#define HRPWM_BCONR2_BTRU0PSPA_POS                     (26U)
#define HRPWM_BCONR2_BTRU0PSPA                         (0x04000000UL)
#define HRPWM_BCONR2_BTRU0PSPB_POS                     (27U)
#define HRPWM_BCONR2_BTRU0PSPB                         (0x08000000UL)
#define HRPWM_BCONR2_BTRU0PDT_POS                      (28U)
#define HRPWM_BCONR2_BTRU0PDT                          (0x10000000UL)
#define HRPWM_BCONR2_BTRU0PCTL_POS                     (29U)
#define HRPWM_BCONR2_BTRU0PCTL                         (0x20000000UL)

